In [107]:
import pandas as pd
import numpy as np

in_data = pd.read_csv("../data/train.csv")

in_data.fillna('0', inplace = True)

gender = {'male' : 1, 'female' : 2}
in_data.Sex = [gender[item] for item in in_data.Sex]

port = {'C' : 1, 'Q' : 2, 'S' : 3, '0' : 0}
in_data.Embarked = [port[item] for item in in_data.Embarked]
in_data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",1,22,1,0,A/5 21171,7.2500,0,3
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,38,1,0,PC 17599,71.2833,C85,1
2,3,1,3,"Heikkinen, Miss. Laina",2,26,0,0,STON/O2. 3101282,7.9250,0,3
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",2,35,1,0,113803,53.1000,C123,3
4,5,0,3,"Allen, Mr. William Henry",1,35,0,0,373450,8.0500,0,3
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",1,27,0,0,211536,13.0000,0,3
887,888,1,1,"Graham, Miss. Margaret Edith",2,19,0,0,112053,30.0000,B42,3
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",2,0,1,2,W./C. 6607,23.4500,0,3
889,890,1,1,"Behr, Mr. Karl Howell",1,26,0,0,111369,30.0000,C148,1
890,891,0,3,"Dooley, Mr. Patrick",1,32,0,0,370376,7.7500,0,2

In [108]:
drop_col = ['Cabin', 'Name', 'Ticket']
in_data.drop(drop_col, inplace = True, axis = 1)
in_data.Age = pd.to_numeric(in_data.Age)

in_data

     PassengerId  Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked
0              1         0       3    1  22.0      1      0   7.2500         3
1              2         1       1    2  38.0      1      0  71.2833         1
2              3         1       3    2  26.0      0      0   7.9250         3
3              4         1       1    2  35.0      1      0  53.1000         3
4              5         0       3    1  35.0      0      0   8.0500         3
..           ...       ...     ...  ...   ...    ...    ...      ...       ...
886          887         0       2    1  27.0      0      0  13.0000         3
887          888         1       1    2  19.0      0      0  30.0000         3
888          889         0       3    2   0.0      1      2  23.4500         3
889          890         1       1    1  26.0      0      0  30.0000         1
890          891         0       3    1  32.0      0      0   7.7500         2

[891 rows x 9 columns]

In [151]:
data = in_data.to_numpy()

In [153]:
Y = data[:, 1]
X = np.delete(data, 1, axis = 1)

In [154]:
print(Y[0])
print(X[0])

0.0
[ 1.    3.    1.   22.    1.    0.    7.25  3.  ]